<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"3309f89e594dc4dbb35b345c4ee75934e2077fd75f792d50733e00dfe6cdd036","plan_job_ref":"Job Pull Request Checks #831 at https://github.com/GSA-TTS/FAC/actions/runs/6109658440","plan_hash":"8332b321d8cc84d5784085922d9dab39dbb7f8eff36b794771f877b532620053","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.environments["dev"].local_file.cf_org will be created
  + resource "local_file" "cf_org" {
      + content              = <<-EOT
            cf_org_name = "gsa-tts-oros-fac"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../dev/orgname.auto.tfvars"
      + id                   = (known after apply)
    }

  # module.environments["preview"].local_file.cf_org will be created
  + resource "local_file" "cf_org" {
      + content              = <<-EOT
            cf_org_name = "gsa-tts-oros-fac"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../preview/orgname.auto.tfvars"
      + id                   = (known after apply)
    }

  # module.environments["production"].local_file.cf_org will be created
  + resource "local_file" "cf_org" {
      + content              = <<-EOT
            cf_org_name = "gsa-tts-oros-fac"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../production/orgname.auto.tfvars"
      + id                   = (known after apply)
    }

  # module.environments["staging"].local_file.cf_org will be created
  + resource "local_file" "cf_org" {
      + content              = <<-EOT
            cf_org_name = "gsa-tts-oros-fac"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./../staging/orgname.auto.tfvars"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #831](https://github.com/GSA-TTS/FAC/actions/runs/6109658440)